# 1st program
print(9 ** 0.5 *5)

# 2nd program
print(9.99 > 9.98 and 1000 != 1000.1)

# 3rd program
print(1234 % 1000 // 10 + 5678 % 1000 // 10 )

# 4th program
print(int(13.42) == 42.13 * 100 % 100 or int(42.13) == 13.42 * 100 % 100)




# 1st program
print(9 ** 0.5 *5)

# 2nd program
print(9.99 > 9.98 and 1000 != 1000.1)

# 3rd program
print(1234 % 1000 // 10 + 5678 % 1000 // 10 )

# 4th program
print(int(13.42) == 42.13 * 100 % 100 or int(42.13) == 13.42 * 100 % 100)

## В момент решения задачи №4 захотелось сделать его для любых возможных дробных чисел, но так и не смог придумать реализацию. Есть функция возвращающая количество знаков до/после запятой?